# Fall 2024 Data Science Track: Week 2 - Data Cleaning Exercise

## Packages, Packages, Packages!

Import *all* the things here! You need the standard stuff: `pandas` and `numpy`.

If you got more stuff you want to use, add them here too. 🙂

In [1]:
# Import here.
import pandas as pd
import numpy as np

## Introduction

With the packages out of the way, now you will be working with the following data sets:

* `food_coded.csv`: [Food choices](https://www.kaggle.com/datasets/borapajo/food-choices?select=food_coded.csv) from Kaggle
* `Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv`: [Ask A Manager Salary Survey 2021 (Responses)](https://docs.google.com/spreadsheets/d/1IPS5dBSGtwYVbjsfbaMCYIWnOuRmJcbequohNxCyGVw/view?&gid=1625408792) as *Tab Separated Values (.tsv)* from Google Docs

Each one poses different challenges. But you’ll―of course―overcome them with what you learned in class! 😉

## Food Choices Data Set

### Load the Data

In [48]:
# Load the Food choices data set into a variable (e.g., df_food).

food_data_set_path = '../data/food_coded.csv'

df_food = pd.read_csv(food_data_set_path)
df_food.head()

,GPA,Gender,breakfast,calories_chicken,calories_day,calories_scone,coffee,comfort_food,comfort_food_reasons,comfort_food_reasons_coded,...,soup,sports,thai_food,tortilla_calories,turkey_calories,type_sports,veggies_day,vitamins,waffle_calories,weight
0,2.4,2,1,430,NaN,315.0,1,none,we dont have comfort,9.0,...,1.0,1.0,1,1165.0,345,car racing,5,1,1315,187
1,3.654,1,1,610,3.0,420.0,2,"chocolate, chips, ice cream","Stress, bored, anger",1.0,...,1.0,1.0,2,725.0,690,Basketball,4,2,900,155
2,3.3,1,1,720,4.0,420.0,2,"frozen yogurt, pizza, fast food","stress, sadness",1.0,...,1.0,2.0,5,1165.0,500,none,5,1,900,I'm not answering this.
3,3.2,1,1,430,3.0,420.0,2,"Pizza, Mac and cheese, ice cream",Boredom,2.0,...,1.0,2.0,5,725.0,690,NaN,3,1,1315,"Not sure, 240"
4,3.5,1,1,720,2.0,420.0,2,"Ice cream, chocolate, chips","Stress, boredom, cravings",1.0,...,1.0,1.0,4,940.0,500,Softball,4,2,760,190

### Explore the Data

How much data did you just load?

In [8]:
# Count by hand. (lol kidding)
count = df_food.shape
print(count)

(125, 61)

What are the columns and their types in this data set?

In [9]:
# Show the column names and their types.
col_types = df_food.dtypes
print(col_types)

GPA                  object
Gender                int64
breakfast             int64
calories_chicken      int64
calories_day        float64
                     ...
type_sports          object
veggies_day           int64
vitamins              int64
waffle_calories       int64
weight               object
Length: 61, dtype: object

### Clean the Data

Perhaps we’d like to know more another day, but the team is really interested in just the relationship between calories (`calories_day`) and weight. …and maybe gender.

Can you remove the other columns?

In [29]:
# Remove ‘em.
keep_cols = df_food[['calories_day','weight','Gender']]
print(keep_cols.head())
print(keep_cols.shape)

   calories_day                    weight  Gender
0           NaN                       187       2
1           3.0                       155       1
2           4.0  I'm not answering this.        1
3           3.0             Not sure, 240       1
4           2.0                       190       1
(125, 3)

What about `NaN`s? How many are there?

In [ ]:
# Count ‘em.
nan_count = df_food.isnull().sum().sum() 
# the first .sum() counts per col; the second .sum() counts for the entire df
print(nan_count)

149

We gotta remove those `NaN`s―the entire row.

In [47]:
# Drop ‘em.
no_nans = keep_cols.dropna()
print(no_nans)

     calories_day                    weight  Gender
1             3.0                       155       1
2             4.0  I'm not answering this.        1
3             3.0             Not sure, 240       1
4             2.0                       190       1
5             3.0                       190       1
..            ...                       ...     ...
118           3.0                       140       1
119           3.0                       185       2
120           4.0                       156       1
121           2.0                       180       1
123           4.0                       135       2

[104 rows x 3 columns]

But what about the weird non-numeric values in the column obviously meant for numeric data?

Notice the data type of that column from when you got the types of all the columns?

If only we could convert the column to a numeric type and drop the rows with invalid values. 🤔

In [53]:
# Fix that.
#print(no_nans.dtypes) # weight is object dtype

df_food_fixed = df_food[['calories_day', 'weight', 'Gender']].copy()
df_food_fixed['weight'] = pd.to_numeric(df_food_fixed['weight'], errors='coerce')
df_food_fixed = df_food_fixed.dropna()
print(df_food_fixed)

     calories_day  weight  Gender
1             3.0   155.0       1
4             2.0   190.0       1
5             3.0   190.0       1
6             3.0   180.0       2
7             3.0   137.0       1
..            ...     ...     ...
118           3.0   140.0       1
119           3.0   185.0       2
120           4.0   156.0       1
121           2.0   180.0       1
123           4.0   135.0       2

[101 rows x 3 columns]

Now this data seems reasonably clean for our purposes! 😁

Let’s save it somewhere to be shipped off to another teammate. 💾

In [55]:
# Savey save!
df_food_fixed.to_csv('../data/cleaned_food_data.csv', index=False)

## Ask a Manager Salary Survey 2021 (Responses) Data Set

### Load the Data

In [60]:
# Load the Ask A Manager Salary Survey 2021 (Responses) data set into a variable (e.g., df_salary).
df_salary = pd.read_csv('../data/Ask A Manager Salary Survey 2021 (Responses) - Form Responses 1.tsv', sep='\t')
df_salary.head()

,Timestamp,How old are you?,What industry do you work in?,Job title,"If your job title needs additional context, please clarify here:","What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)","How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.",Please indicate the currency,"If ""Other,"" please indicate the currency here:","If your income needs additional context, please provide it here:",What country do you work in?,"If you're in the U.S., what state do you work in?",What city do you work in?,How many years of professional work experience do you have overall?,How many years of professional work experience do you have in your field?,What is your highest level of education completed?,What is your gender?,What is your race? (Choose all that apply.)
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

Was that hard? 🙃

#### rename the file to something that is better for all systems.  
* No spaces in filename (can use '_')
* all lower case

### Explore

You know the drill.

How much data did you just load?

In [ ]:
# Count by hand. I’m dead serious.
count = df_salary.shape
print(count)

(28062, 18)

What are the columns and their types?

In [62]:
# Show the column names and their types.
col_types = df_salary.dtypes
print(col_types)

Timestamp                                                                                                                                                                                                                                object
How old are you?                                                                                                                                                                                                                         object
What industry do you work in?                                                                                                                                                                                                            object
Job title                                                                                                                                                                                                                                object
If your job title needs additional context, please clarify here:                                                                                                                                                                         object
What is your annual salary? (You'll indicate the currency in a later question. If you are part-time or hourly, please enter an annualized equivalent -- what you would earn if you worked the job 40 hours a week, 52 weeks a year.)     object
How much additional monetary compensation do you get, if any (for example, bonuses or overtime in an average year)? Please only include monetary compensation here, not the value of benefits.                                          float64
Please indicate the currency                                                                                                                                                                                                             object
If "Other," please indicate the currency here:                                                                                                                                                                                           object
If your income needs additional context, please provide it here:                                                                                                                                                                         object
What country do you work in?                                                                                                                                                                                                             object
If you're in the U.S., what state do you work in?                                                                                                                                                                                        object
What city do you work in?                                                                                                                                                                                                                object
How many years of professional work experience do you have overall?                                                                                                                                                                      object
How many years of professional work experience do you have in your field?                                                                                                                                                                object
What is your highest level of education completed?                                                                                                                                                                                       object
What is your gender?                                                                                                                                                                                                                     object
What is your race? (Choose all that apply.)                                                                                                                                                                                              object
dtype: object

Oh… Ugh! Give these columns easier names to work with first. 🙄

In [64]:
# Rename ‘em.
# Non-binding suggestions: timestamp, age, industry, title, title_context, salary, additional_compensation, currency, other_currency, salary_context, country, state, city, total_yoe, field_yoe, highest_education_completed	gender, race

new_colnames = ['timestamp', 'age', 'industry', 'title', 'title_context', 
                'salary', 'additional_compensation', 'currency', 'other_currency', 
                'salary_context', 'country', 'state', 'city', 'total_yoe', 
                'field_yoe', 'highest_education_completed', 'gender', 'race']

df_salary.columns = new_colnames

df_salary.head()

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
0,4/27/2021 11:02:10,25-34,Education (Higher Education),Research and Instruction Librarian,NaN,"55,000",0.0,USD,NaN,NaN,United States,Massachusetts,Boston,5-7 years,5-7 years,Master's degree,Woman,White
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
2,4/27/2021 11:02:38,25-34,"Accounting, Banking & Finance",Marketing Specialist,NaN,"34,000",NaN,USD,NaN,NaN,US,Tennessee,Chattanooga,2 - 4 years,2 - 4 years,College degree,Woman,White
3,4/27/2021 11:02:41,25-34,Nonprofits,Program Manager,NaN,"62,000",3000.0,USD,NaN,NaN,USA,Wisconsin,Milwaukee,8 - 10 years,5-7 years,College degree,Woman,White
4,4/27/2021 11:02:42,25-34,"Accounting, Banking & Finance",Accounting Manager,NaN,"60,000",7000.0,USD,NaN,NaN,US,South Carolina,Greenville,8 - 10 years,5-7 years,College degree,Woman,White

It’s a lot, and that should not have been easy. 😏

You’re going to have a gander at the computing/tech subset first because thats *your* industry. But first, what value corresponds to that `industry`?

In [69]:
# List the unique industries and a count of their instances.
print(df_salary['industry'].value_counts())

industry
Computing or Tech                        4699
Education (Higher Education)             2464
Nonprofits                               2419
Health care                              1896
Government and Public Administration     1889
                                         ...
Warehousing                                 1
Education (Early Childhood Education)       1
SAAS                                        1
Health and Safety                           1
Aerospace Manufacturing                     1
Name: count, Length: 1219, dtype: int64

That value among the top 5 is what you’re looking for innit? Filter out all the rows not in that industry and save it into a new dataframe.

In [70]:
# Filtery filter. (Save it to a new variable, df_salary_tech.)
df_salary_tech = df_salary[df_salary['industry'] == 'Computing or Tech']
df_salary_tech.head()

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
1,4/27/2021 11:02:22,25-34,Computing or Tech,Change & Internal Communications Manager,NaN,"54,600",4000.0,GBP,NaN,NaN,United Kingdom,NaN,Cambridge,8 - 10 years,5-7 years,College degree,Non-binary,White
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White

Do a sanity check to make sure that the only values you kept are the one you are filtered for.

In [ ]:
# Sanity Check 
print(df_salary_tech['industry'].value_counts())

industry
Computing or Tech    4699
Name: count, dtype: int64

We are very interested in salary figures. But how many dollars 💵 is a euro 💶 or a pound 💷? That sounds like a problem for another day. 🫠

For now, let’s just look at U.S. dollars (`'USD'`).

In [73]:
# Filtery filter for just the jobs that pay in USD!
df_salary_tech_usd = df_salary_tech[df_salary_tech['currency'] == 'USD']
df_salary_tech_usd.head()

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,United States,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",USA,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,USA,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,4/27/2021 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,"200,850",40000.0,USD,NaN,NaN,USA,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White

What we really want know is how each U.S. city pays in tech. What value in `country` represents the United States of America?

In [74]:
# We did filter for USD, so if we do a count of each unique country in descending count order, the relevant value(s) should show up at the top.
print(df_salary_tech_usd['country'].value_counts())

country
United States               1576
USA                         1222
US                           412
U.S.                         108
United States of America      90
                            ...
Ghana                          1
Nigeria                        1
ss                             1
Nigeria                        1
Burma                          1
Name: count, Length: 76, dtype: int64

### Clean the Data

Well, we can’t get our answers with what we currently have, so you’ll have to make some changes.

Let’s not worry about anything below the first 5 values for now. Convert the top 5 to a single canonical value―say, `'US'`, which is nice and short.

In [77]:
# Replace them all with 'US'.
vals_to_replace = ['United States', 'USA', 'US', 'U.S.', 'United States of America']
df_salary_tech_usd = df_salary_tech[df_salary_tech['currency'] == 'USD'].copy()
df_salary_tech_usd['country'] = df_salary_tech_usd['country'].replace(vals_to_replace, 'US')

df_salary_tech_usd.head()

,timestamp,age,industry,title,title_context,salary,additional_compensation,currency,other_currency,salary_context,country,state,city,total_yoe,field_yoe,highest_education_completed,gender,race
8,4/27/2021 11:03:01,45-54,Computing or Tech,Systems Analyst,Data developer/ETL Developer,"112,000",10000.0,USD,NaN,NaN,US,Missouri,St. Louis,21 - 30 years,21 - 30 years,College degree,Woman,White
43,4/27/2021 11:04:04,25-34,Computing or Tech,Principal Software Engineer,NaN,"187,500",5000.0,USD,NaN,NaN,US,Pennsylvania,Pittsburgh,8 - 10 years,5-7 years,College degree,Woman,White
44,4/27/2021 11:04:04,25-34,Computing or Tech,Intelligence Analyst,NaN,"110,000",20000.0,USD,NaN,"Around 20,000 a year in stock",US,Virginia,"Arlington, VA",8 - 10 years,8 - 10 years,Master's degree,Man,White
46,4/27/2021 11:04:07,35-44,Computing or Tech,Mobile developer,NaN,"144,600",2500.0,USD,NaN,NaN,US,Massachusetts,Boston,5-7 years,5-7 years,PhD,Woman,White
47,4/27/2021 11:04:09,35-44,Computing or Tech,Product Design Director,NaN,"200,850",40000.0,USD,NaN,NaN,US,North Carolina,Chapel Hill,11 - 20 years,11 - 20 years,College degree,Woman,White

Have a look at the count of each unique country again now.

In [78]:
# Count again.
print(df_salary_tech_usd['country'].value_counts())

country
US                3408
United States       68
Usa                 59
USA                 56
usa                 28
                  ...
Ghana                1
Nigeria              1
ss                   1
Nigeria              1
Burma                1
Name: count, Length: 72, dtype: int64

Did you notice anything interesting?

In [81]:
# BONUS CREDIT: resolve [most of] those anomalous cases too without exhaustively taking every variant literally into account.
#normalize
df_salary_tech_usd['country'] = df_salary_tech_usd['country'].str.lower().str.strip()
values_to_replace = ['united states', 'united states of america', 'usa', 'u.s.', 'u.s.a.', 'us', 'america', 'u.s.a', 'u.s', 'united state of america', 'unitedstates']
df_salary_tech_usd['country'] = df_salary_tech_usd['country'].replace(values_to_replace, 'US')

In [82]:

# BONUS CREDIT: if you’ve resolved it, let’s see how well you did by counting the number of instances of each unique value.
print(df_salary_tech_usd['country'].value_counts())

country
US                      3715
canada                     5
israel                     5
australia                  2
france                     2
poland                     2
brazil                     2
singapore                  2
spain                      2
india                      2
unite states               2
new zealand                2
denmark                    2
nigeria                    2
united kingdom             2
united state               1
puerto rico                1
uniyed states              1
cuba                       1
international              1
italy                      1
danmark                    1
uruguay                    1
isa                        1
united stateds             1
united stated              1
remote (philippines)       1
pakistan                   1
mexico                     1
san francisco              1
netherlands                1
romania                    1
japan                      1
united stares              1
china                      1
australian                 1
jamaica                    1
thailand                   1
unites states              1
colombia                   1
ghana                      1
ss                         1
burma                      1
Name: count, dtype: int64

It’s looking good so far. Let’s find out the minimum, mean, and maximum (in that order) salary by state, sorted by the mean in descending order.

In [83]:
# Find the minimum, mean, and maximum salary in USD by U.S. state.
salary_by_state = df_salary_tech_usd.groupby('state')['salary'].agg(['min', 'mean', 'max'])

TypeError: agg function failed [how->mean,dtype->object]

Well, pooh! We forgot that `salary` isn’t numeric. Something wrong must be fixed.

In [84]:
# Fix it.
df_salary_tech_usd['salary'] = pd.to_numeric(df_salary_tech_usd['salary'], errors='coerce')
df_salary_tech_usd = df_salary_tech_usd.dropna(subset=['salary'])
print(df_salary_tech_usd['salary'].dtype)

float64

Let’s try that again.

In [86]:
salary_by_state = df_salary_tech_usd.groupby('state')['salary'].agg(['min', 'mean', 'max'])
print(salary_by_state)

                                     min           mean        max
state
Alabama                          35000.0  117400.000000   350000.0
Arizona                          35000.0   97833.333333   145000.0
Arkansas                             4.0   58001.000000    95000.0
California                           0.0  153286.988827   520000.0
California, Colorado            176000.0  176000.000000   176000.0
California, Maryland             81500.0   81500.000000    81500.0
California, Oregon              200000.0  200000.000000   200000.0
Colorado                         49400.0  109291.891892   165000.0
Connecticut                      68000.0  161610.000000   270000.0
Delaware                        169000.0  169000.000000   169000.0
District of Columbia             59000.0  142923.076923   200000.0
District of Columbia, Virginia  109200.0  109200.000000   109200.0
Florida                          28800.0  210711.000000  2600000.0
Georgia                          29120.0  115297.647059   242000.0
Idaho                            74860.0  105465.000000   170000.0
Illinois                         36000.0  117555.571429   228800.0
Indiana                          15000.0   82875.000000   140000.0
Iowa                             63000.0  101200.000000   142000.0
Kansas                           41500.0  109666.666667   167000.0
Kentucky                         62000.0  102500.000000   125000.0
Louisiana                        75000.0   80500.000000    84000.0
Louisiana, Washington           117000.0  117000.000000   117000.0
Maine                            50000.0  103833.333333   173000.0
Maryland                         62000.0  119955.461538   176000.0
Massachusetts                    41000.0  125899.155844   400000.0
Michigan                         41600.0   95758.823529   235000.0
Michigan, Texas, Washington     340000.0  340000.000000   340000.0
Minnesota                        52124.0  101064.941176   210000.0
Missouri                            80.0   80339.923077   200000.0
Montana                          65000.0  112666.666667   145000.0
Nebraska                         43000.0   76736.000000   140000.0
Nevada                          107100.0  124550.000000   142000.0
New Hampshire                       55.0   87175.833333   130000.0
New Jersey                       67500.0  124090.909091   192000.0
New Jersey, New York            135000.0  137500.000000   140000.0
New Mexico                       82000.0   95733.333333   115200.0
New York                         14000.0  146594.112150   590000.0
North Carolina                   29000.0   97841.666667   165000.0
Ohio                             42000.0  137066.666667   954000.0
Oklahoma                         36958.0   84802.571429   180000.0
Oregon                           16200.0  122640.000000   230000.0
Pennsylvania                     52000.0  116826.388889   237000.0
Rhode Island                     76000.0   99475.000000   122950.0
South Carolina                   40000.0   40000.000000    40000.0
Tennessee                        61500.0   91750.000000   144000.0
Texas                            10700.0  103685.245902   190000.0
Utah                             33280.0  105023.333333   176000.0
Vermont                          91250.0  105625.000000   120000.0
Virginia                         58750.0  115086.696970   378000.0
Washington                          72.0  136923.916667   300000.0
West Virginia                   120000.0  120000.000000   120000.0
Wisconsin                            1.0  145806.888889   920000.0

That did the trick! Now let’s narrow this to data 2021 and 2022 just because (lel). *(Hint: that timestamp column may not be a temporal type right now.)*

In [87]:
# Filter the data to within 2021, 2022, or 2023, saving the DataFrame to a new variable, and generate the summary again.
df_salary_tech_usd['timestamp'] = pd.to_datetime(df_salary_tech_usd['timestamp'])
df_salary_filtered = df_salary_tech_usd[df_salary_tech_usd['timestamp'].dt.year.isin([2021, 2022, 2023])].copy()
salary_by_state_filtered = df_salary_filtered.groupby('state')['salary'].agg(['min', 'mean', 'max'])
print(salary_by_state_filtered)

                                     min           mean       max
state
Alabama                          52000.0  138000.000000  350000.0
Arizona                          35000.0   97833.333333  145000.0
Arkansas                         60000.0   77333.333333   95000.0
California                           0.0  153754.893258  520000.0
California, Colorado            176000.0  176000.000000  176000.0
California, Maryland             81500.0   81500.000000   81500.0
California, Oregon              200000.0  200000.000000  200000.0
Colorado                         49400.0  109291.891892  165000.0
Connecticut                      68000.0  161610.000000  270000.0
Delaware                        169000.0  169000.000000  169000.0
District of Columbia             59000.0  142923.076923  200000.0
District of Columbia, Virginia  109200.0  109200.000000  109200.0
Florida                          28800.0  102106.954545  170000.0
Georgia                          29120.0  115488.484848  242000.0
Idaho                            74860.0  105465.000000  170000.0
Illinois                         36000.0  119248.382353  228800.0
Indiana                          15000.0   82875.000000  140000.0
Iowa                             63000.0  101200.000000  142000.0
Kansas                           41500.0  109666.666667  167000.0
Kentucky                         62000.0  102500.000000  125000.0
Louisiana                        75000.0   80500.000000   84000.0
Louisiana, Washington           117000.0  117000.000000  117000.0
Maine                            50000.0  103833.333333  173000.0
Maryland                         62000.0  119955.461538  176000.0
Massachusetts                    41000.0  125660.986842  400000.0
Michigan                         41600.0   95758.823529  235000.0
Michigan, Texas, Washington     340000.0  340000.000000  340000.0
Minnesota                        52124.0  102381.500000  210000.0
Missouri                            80.0   80339.923077  200000.0
Montana                          65000.0  112666.666667  145000.0
Nebraska                         43000.0   76736.000000  140000.0
Nevada                          107100.0  124550.000000  142000.0
New Hampshire                       55.0   87175.833333  130000.0
New Jersey                       67500.0  124090.909091  192000.0
New Jersey, New York            135000.0  137500.000000  140000.0
New Mexico                       82000.0   95733.333333  115200.0
New York                         14000.0  146594.112150  590000.0
North Carolina                   29000.0   97250.000000  165000.0
Ohio                             42000.0  137066.666667  954000.0
Oklahoma                         36958.0   84802.571429  180000.0
Oregon                           16200.0  122640.000000  230000.0
Pennsylvania                     52000.0  116826.388889  237000.0
Rhode Island                     76000.0   99475.000000  122950.0
Tennessee                        61500.0   91750.000000  144000.0
Texas                            10700.0  103685.245902  190000.0
Utah                             33280.0  105023.333333  176000.0
Vermont                          91250.0  105625.000000  120000.0
Virginia                         58750.0  115086.696970  378000.0
Washington                          72.0  137427.774648  300000.0
West Virginia                   120000.0  120000.000000  120000.0
Wisconsin                            1.0  145806.888889  920000.0

/tmp/ipykernel_2983/301426315.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_salary_tech_usd['timestamp'] = pd.to_datetime(df_salary_tech_usd['timestamp'])

## Bonus

Clearly, we do not have enough data to produce useful figures for the level of specificity you’ve now reached. What do you notice about Delaware and West Virginia?

Let’s back out a bit and return to `df_salary` (which was the loaded data with renamed columns but *sans* filtering).

### Bonus #0

Apply the same steps as before to `df_salary`, but do not filter for any specific industry. Do perform the other data cleaning stuff, and get to a point where you can generate the minimum, mean, and maximum by state.

In [88]:
df_salary['salary'] = pd.to_numeric(df_salary['salary'], errors='coerce')
df_salary = df_salary.dropna(subset=['salary'])

df_salary['country'] = df_salary['country'].str.lower().str.strip()
values_to_replace = ['united states', 'united states of america', 'usa', 'u.s.', 'u.s.a.', 'us', 'america', 'u.s.a', 'u.s', 'united state of america', 'unitedstates']
df_salary['country'] = df_salary['country'].replace(values_to_replace, 'US')
df_salary_us = df_salary[df_salary['country'] == 'US'].copy()

salary_by_state = df_salary_us.groupby('state')['salary'].agg(['min', 'mean', 'max'])
print(salary_by_state)

                         min           mean         max
state
Alabama                 54.0   70454.170732    350000.0
Alabama, California  29120.0   29120.000000     29120.0
Alabama, Oregon      50000.0   50000.000000     50000.0
Alaska               47840.0  737319.200000  10000000.0
Arizona              26500.0   86190.060241    380000.0
...                      ...            ...         ...
Virginia                57.0   96315.936073   1300000.0
Washington              72.0   98283.044983    300000.0
West Virginia            0.0   52754.375000    120000.0
Wisconsin                1.0   83000.628788    920000.0
Wyoming              42500.0   59906.333333     98000.0

[81 rows x 3 columns]

### Bonus #1

This time, format the table output nicely (*$12,345.00*) without modifying the values in the `DataFrame`. That is, `df_salary` should be identical before versus after running your code.

(*Hint: if you run into an error about `jinja2` perhaps you need to `pip install` something.*)

In [89]:
formatted_salary_table = salary_by_state.style.format('${:,.2f}')
formatted_salary_table

### Bonus #2

Filter out the non-single-states (e.g., `'California, Colorado'`) in the most elegant way possible (i.e., *not* by blacklisting all the bad values).

In [92]:
df_single_states = df_salary_us[~df_salary_us['state'].str.contains(',', na=False)]
print(df_single_states['state'].value_counts())

state
California              738
New York                594
Massachusetts           398
Texas                   370
Illinois                320
Washington              289
Pennsylvania            268
Ohio                    222
Virginia                219
District of Columbia    218
Minnesota               188
Florida                 188
Georgia                 174
Oregon                  171
North Carolina          171
Maryland                159
Colorado                158
Michigan                157
Wisconsin               132
New Jersey              119
Missouri                114
Indiana                  94
Arizona                  83
Tennessee                76
Connecticut              69
Kentucky                 65
Utah                     50
Maine                    47
Iowa                     42
Alabama                  41
Kansas                   38
South Carolina           38
Louisiana                38
Idaho                    37
New Hampshire            36
Nebraska                 31
Oklahoma                 29
New Mexico               25
Nevada                   25
Arkansas                 24
Montana                  22
Rhode Island             19
Vermont                  17
Alaska                   15
North Dakota             15
Mississippi              13
Delaware                  9
West Virginia             8
Hawaii                    8
Wyoming                   6
South Dakota              4
Name: count, dtype: int64

### Bonus #3

Show the quantiles instead of just minimum, mean, and maximum―say 0%, 5%, 25%, 50%, 75%, 95%, and 100%. Outliers may be deceiving.

Sort by whatever interests you―like say the *50th* percentile.

And throw in a count by state too. It would be interesting to know how many data points contribute to the figures for each state. (*Hint: your nice formatting from Bonus #1 might not work this time around.* 😜)

In [95]:
salary_quantiles = df_single_states.groupby('state')['salary'].agg(['count', 0.0, 0.05, 0.25, 0.50, 0.75, 0.95, 1.0])
sorted_quantiles = salary_quantiles.sort_values(by=0.5)
print(sorted_quantiles)

TypeError: 'float' object is not callable